Tekla.Structures.Model.UI.GraphicPolyLine.LineType
The appearance of the line. For instance solid, dashed or dotted.

Tekla.Structures.Model.UI.GraphicPolyLine.LineType.Solid
The solid line type.

Tekla.Structures.Model.UI.GraphicPolyLine.LineType.Dashed1
The first dashed line type.

Tekla.Structures.Model.UI.GraphicPolyLine.LineType.Dashed2
The second dashed line type.

Tekla.Structures.Model.UI.GraphicPolyLine.LineType.DashedAndDotted
The dashed and dotted line type.

Tekla.Structures.Model.UI.GraphicPolyLine.LineType.Dotted
The dotted line type.